<a href="https://colab.research.google.com/github/XingxinHE/Pandas_Exercise/blob/master/05_Stats_US_Baby_Names.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [3]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [11]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [14]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [15]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [25]:
baby_names.Name.value_counts() #我这种做法明显错误在于，我没有考虑他们这些名字会有重复

Riley        1112
Avery        1080
Jordan       1073
Peyton       1064
Hayden       1049
Taylor       1033
Jayden       1031
Alexis        984
Payton        971
Dakota        962
Angel         962
Logan         957
Parker        947
Morgan        945
Cameron       944
Ryan          901
Dylan         895
Skyler        895
Reese         880
Quinn         873
Skylar        872
Kayden        872
Rowan         842
Jaden         840
Charlie       816
Rylee         799
Emerson       798
Kendall       793
Micah         788
Jaiden        779
             ...
Deontre         1
Lynnox          1
Rizwan          1
Antjuan         1
Elwin           1
Rivaan          1
Mileigh         1
Caellum         1
Keny            1
Aleli           1
Kortlynn        1
Javaeh          1
Majestic        1
Alohilani       1
Khizar          1
Tres            1
Fouad           1
Lyrica          1
Marianela       1
Harkirat        1
Keyshia         1
Cathaleya       1
Aniaya          1
Lidya           1
Manessa         1
Kamakana        1
Yuepheng        1
Yuren           1
Munachiso       1
Dago            1
Name: Name, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [31]:
name_counts = baby_names.Name.value_counts()
name_counts = pd.DataFrame(name_counts)
name_counts.tail()

           Name
Kamakana      1
Yuepheng      1
Yuren         1
Munachiso     1
Dago          1

In [33]:
pd.value_counts(name_counts.Name).head(1)
#一共有3682个名字只有一个人

1    3682
Name: Name, dtype: int64

### Step 11. What is the median name occurrence?

In [35]:
name_counts.Name.median()

8.0

### Step 12. What is the standard deviation of names?

In [36]:
name_counts.Name.std()

122.0299635081389

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [38]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

### 以上我的做法根本性错误了，

作者给的答案是将以name为group，最后sum，其余的答案轻而易举得知道

In [39]:
#以name为group
names = baby_names.groupby('Name').sum()
names.head()

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6

In [40]:
#删除没用的year
del names['Year']
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [44]:
#名字最多的不是Riley，而是 Jacob
names.sort_values('Count',ascending=False).head(2)

        Count
Name
Jacob  242874
Emma   214852

In [45]:
#名字最多的还可以这么算出来
names.idxmax()

Count    Jacob
dtype: object

In [43]:
#当然我刚刚的nunique()看有多少unique的没错，但是groupby之后也行
names.shape
#总共17632个独一无二的名字

(17632, 1)

In [47]:
#哪些名字出现的最少
names[names['Count'] == names['Count'].min()]  #mask是等于'Count' column最小值

            Count
Name
Aadarsh         5
Aadin           5
Aaima           5
Aalaya          5
Aaminah         5
Aaniya          5
Aaria           5
Aarika          5
Aarvi           5
Aaryav          5
Aasha           5
Aashritha       5
Aasia           5
Aayansh         5
Abbiegail       5
Abdifatah       5
Abdihafid       5
Abdiqani        5
Abdirahim       5
Abdishakur      5
Abdo            5
Abeer           5
Abelino         5
Abenezer        5
Abhijot         5
Abhimanyu       5
Abigaile        5
Aceyn           5
Ackley          5
Adalay          5
...           ...
Zeenat          5
Zeeshan         5
Zein            5
Zeinabou        5
Zekhi           5
Zeltzin         5
Zemirah         5
Zenab           5
Ziare           5
Zienna          5
Zimere          5
Zinachidi       5
Zita            5
Ziv             5
Ziyan           5
Ziza            5
Zlatan          5
Zniyah          5
Zohaib          5
Zohal           5
Zoria           5
Zuleidy         5
Zunaira         5
Zyairah         5
Zyeria          5
Zyien           5
Zyire           5
Zykeriah        5
Zykierra        5
Zymari          5

[2578 rows x 1 columns]

In [49]:
len(names[names['Count'] == names['Count'].min()] )

2578

In [50]:
#中位数的名字是什么？
names[ names.Count == names.Count.median()]

            Count
Name
Aishani        49
Alara          49
Alysse         49
Ameir          49
Anely          49
Antonina       49
Aveline        49
Aziah          49
Baily          49
Caleah         49
Carlota        49
Cristine       49
Dahlila        49
Darvin         49
Deante         49
Deserae        49
Devean         49
Elizah         49
Emmaly         49
Emmanuela      49
Envy           49
Esli           49
Fay            49
Gurshaan       49
Hareem         49
Iven           49
Jaice          49
Jaiyana        49
Jamiracle      49
Jelissa        49
...           ...
Kyndle         49
Kynsley        49
Leylanie       49
Maisha         49
Malillany      49
Mariann        49
Marquell       49
Maurilio       49
Mckynzie       49
Mehdi          49
Nabeel         49
Nalleli        49
Nassir         49
Nazier         49
Nishant        49
Rebecka        49
Reghan         49
Ridwan         49
Riot           49
Rubin          49
Ryatt          49
Sameera        49
Sanjuanita     49
Shalyn         49
Skylie         49
Sriram         49
Trinton        49
Vita           49
Yoni           49
Zuleima        49

[66 rows x 1 columns]

In [51]:
#方差
names.Count.std()

11006.06946789057

In [52]:
#summary of names
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000